# To be done

In [2]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('data/splitted/test.csv')

df.head()

   Survived  Pclass  Sex        Age  SibSp  Parch    Fare  Embarked
0         0       3    0  29.699118      0      0   8.050         0
1         0       3    0  50.000000      0      0   8.050         0
2         0       3    0  19.000000      0      0   7.775         0
3         0       3    0   4.000000      3      2  27.900         0
4         1       1    0  38.000000      1      0  90.000         0

In [4]:
df.drop(columns=['PassengerId', 'Name', 'Ticket', 'Cabin'], inplace=True)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [11]:
categorical = ['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Embarked']
for col in categorical:
    df[col] = df[col].astype('category')
    
df.dtypes

Survived    category
Pclass      category
Sex         category
Age          float64
SibSp       category
Parch       category
Fare         float64
Embarked    category
dtype: object